Mostafa-Elshiekh/Graduation_project/MCAL drivers/include/STM32_F103C8.h
/*
 * STM32_F103C8.h
 *
 *  Created on: Feb 5, 2022
 *      Author: Mostafa Mahmoud Elshiekh
 */

#ifndef INC_STM32_F103C8_H_
#define INC_STM32_F103C8_H_


/*==========================================================*/
//includes
/*==========================================================*/
#include <stdlib.h>
#include <stdint.h>

/************************************************************************************/

/*==========================================================*/
//Base Addresses For Memory
/*==========================================================*/
#define FLASH_MEMOY_BASE                          0x08000000
#define SYSTEM_MEMORY_BASE                        0x1FFFF000
#define SRAM_MEMORY_BASE                          0x20000000
#define PERIPHERALS_BASE                          0x20000000
#define CORTEX_M3_INTERNAL_PERIPHERALS_BASE       0xE0000000


/************************************************************************************/

/*==========================================================*/
/*Base Addresses For BUS PERIPHERALS*/
/*==========================================================*/

/*1-Base Addresses For AHB PERIPHERALS*/
#define RCC_BASE                                  0x40021000

/*2-Base Addresses For ABB1 PERIPHERALS*/

//USART2
#define USART2_BASE                              0x40004400

//USART3
#define USART3_BASE                              0x40004800

//SPI2
#define SPI2_BASE                                0X40003800

//I2C
#define I2C1_BASE                                0X40005400
#define I2C2_BASE                                0X40005800


/*3-Base Addresses For ABB2 PERIPHERALS*/

//GPIO
// IN LQFP48 PACKAGE A,B GPIO FULLY INCLUDED & C,D PARTIAL INCLUDED & E NOT EXIST
#define GPIOA_BASE                               0x40010800
#define GPIOB_BASE                               0x40010C00
#define GPIOC_BASE                               0x40011000
#define GPIOD_BASE                               0x40011400
#define GPIOE_BASE                               0x40011800

//EXIT
#define EXTI_BASE                                0x40010400

//AFIO
#define AFIO_BASE                                0x40010000

//NVIC
#define NVIC_BASE                                0xE000E100

//USART1
#define USART1_BASE                              0x40013800

//SPI1
#define SPI1_BASE                                0X40013000


//NVIC REGISTERS MAP
#define NVIC_ISER0                              *( volatile uint32_t *)(NVIC_BASE+0x0000)
#define NVIC_ISER1                              *( volatile uint32_t *)(NVIC_BASE+0x0004)
#define NVIC_ISER2                              *( volatile uint32_t *)(NVIC_BASE+0x0008)
#define NVIC_ICER0                              *( volatile uint32_t *)(NVIC_BASE+0x0080)
#define NVIC_ICER1                              *( volatile uint32_t *)(NVIC_BASE+0x0084)
#define NVIC_ICER2                              *( volatile uint32_t *)(NVIC_BASE+0x0088)

/************************************************************************************/

/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS*/
/*==========================================================*/


/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (RCC)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t CR;
	volatile uint32_t CFGR;
	volatile uint32_t CIR;
	volatile uint32_t APB2RSTR;
	volatile uint32_t AHBENR;
	volatile uint32_t APB1RSTR;
	volatile uint32_t APB2ENR;
	volatile uint32_t APB1ENR;
	volatile uint32_t BDCR;
	volatile uint32_t CSR;
	volatile uint32_t AHBSTR;
	volatile uint32_t CFGR2;
}RCC_TypeDef;


/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (GPIO)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t CRL;
	volatile uint32_t CRH;
	volatile uint32_t IDR;
	volatile uint32_t ODR;
	volatile uint32_t BSRR;
	volatile uint32_t BRR;
	volatile uint32_t LCKR;
}GPIO_TypeDef;


/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (EXTI)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t IMR;
	volatile uint32_t EMR;
	volatile uint32_t RTSR;
	volatile uint32_t FTSR;
	volatile uint32_t SWIER;
	volatile uint32_t PR;
}EXTI_TypeDef;


/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (AFIO)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t EVCR;
	volatile uint32_t MAPR;

	/*volatile uint32_t EXTICR1;
	volatile uint32_t EXTICR2;
	volatile uint32_t EXTICR3;
	volatile uint32_t EXTICR4; */  //0X14
	volatile uint32_t EXTICR[4];

	volatile uint32_t RESERVED0; //0X18
	volatile uint32_t MAPR2;     //0X1C
}AFIO_TypeDef;


/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (USART)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t SR;
	volatile uint32_t DR;
	volatile uint32_t BRR;
	volatile uint32_t CR1;
	volatile uint32_t CR2;
	volatile uint32_t CR3;
	volatile uint32_t GTPR;

}USART_TypeDef;


/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (SPI)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t SPI_CR1;
	volatile uint32_t SPI_CR2;
	volatile uint32_t SPI_SR;
	volatile uint32_t SPI_DR;
	volatile uint32_t SPI_CRCPR;
	volatile uint32_t SPI_RXCRCR;
	volatile uint32_t SPI_TXCRCR;
	volatile uint32_t SPI_I2SCFGR;
	volatile uint32_t SPI_I2SPR;

}SPI_TypeDef;

/*==========================================================*/
/*Base Addresses For PERIPHERALS REGISTERS (I2C)*/
/*==========================================================*/
typedef struct
{
	volatile uint32_t I2C_CR1;
	volatile uint32_t I2C_CR2;
	volatile uint32_t I2C_OAR1;
	volatile uint32_t I2C_OAR2;
	volatile uint32_t I2C_DR;
	volatile uint32_t I2C_SR1;
	volatile uint32_t I2C_SR2;
	volatile uint32_t I2C_CCR;
	volatile uint32_t I2C_TRISE;

