Mostafa-Elshiekh/Graduation_project/MCAL drivers/include/STM32_F103C8.h
}I2C_TypeDef;



/************************************************************************************/

/*==========================================================*/
/*PERIPHERALS INSTANCE*/
/*==========================================================*/
#define GPIOA                        ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB                        ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC                        ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD                        ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOE                        ((GPIO_TypeDef *)GPIOE_BASE)

#define RCC                          ((RCC_TypeDef *)RCC_BASE)

#define EXTI                         ((EXTI_TypeDef *)EXTI_BASE)

#define AFIO                         ((AFIO_TypeDef *)AFIO_BASE)

#define USART1                       ((USART_TypeDef *)USART1_BASE)
#define USART2                       ((USART_TypeDef *)USART2_BASE)
#define USART3                       ((USART_TypeDef *)USART3_BASE)

#define SPI1                         ((SPI_TypeDef *)SPI1_BASE)
#define SPI2                         ((SPI_TypeDef *)SPI2_BASE)

#define I2C1                         ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                         ((I2C_TypeDef *) I2C2_BASE)

/************************************************************************************/

/*==========================================================*/
/*CLOCK ENABLE MACROS*/
/*==========================================================*/
//GPIO
#define RCC_GPIOA_CLOCK_EN()             (RCC->APB2ENR |=(1<<2))
#define RCC_GPIOB_CLOCK_EN()             (RCC->APB2ENR |=(1<<3))
#define RCC_GPIOC_CLOCK_EN()             (RCC->APB2ENR |=(1<<4))
#define RCC_GPIOD_CLOCK_EN()             (RCC->APB2ENR |=(1<<5))
#define RCC_GPIOE_CLOCK_EN()             (RCC->APB2ENR |=(1<<6))
//AFIO
#define RCC_AFIO_CLOCK_EN()              (RCC->APB2ENR |=(1<<0))
//USART
#define RCC_USART1_CLOCK_EN()            (RCC->APB2ENR |=(1<<14))
#define RCC_USART2_CLOCK_EN()            (RCC->APB1ENR |=(1<<17))
#define RCC_USART3_CLOCK_EN()            (RCC->APB1ENR |=(1<<18))
//SPI
#define RCC_SPI1_CLOCK_EN()              (RCC->APB2ENR |=(1<<12))
#define RCC_SPI2_CLOCK_EN()              (RCC->APB1ENR |=(1<<14))
//I2C
#define RCC_I2C1_CLOCK_EN()              (RCC->APB1ENR |=(1<<21))
#define RCC_I2C2_CLOCK_EN()              (RCC->APB1ENR |=(1<<22))


/*==========================================================*/
                     /*RESET MECHANISM*/
/*==========================================================*/
#define RCC_USART1_RESET()            (RCC->APB2RSTR |=(1<<14))
#define RCC_USART2_RESET()            (RCC->APB1RSTR |=(1<<17))
#define RCC_USART3_RESET()            (RCC->APB1RSTR |=(1<<18))
//SPI
#define RCC_SPI1_RESET()              (RCC->APB2RSTR |=(1<<12))
#define RCC_SPI2_RESET()              (RCC->APB1RSTR |=(1<<14))
//I2C
#define RCC_I2C1_RESET()              (RCC->APB2RSTR |=(1<<21))
#define RCC_I2C2_RESET()              (RCC->APB1RSTR |=(1<<22))
/************************************************************************************/

/*==========================================================*/
/*EXTI_IRQ MACROS*/
/*==========================================================*/
#define EXTI0_IRQ                         6
#define EXTI1_IRQ                         7
#define EXTI2_IRQ                         8
#define EXTI3_IRQ                         9
#define EXTI4_IRQ                         10
#define EXTI5_IRQ                         23
#define EXTI6_IRQ                         23
#define EXTI7_IRQ                         23
#define EXTI8_IRQ                         23
#define EXTI9_IRQ                         23
#define EXTI10_IRQ                        40
#define EXTI11_IRQ                        40
#define EXTI12_IRQ                        40
#define EXTI13_IRQ                        40
#define EXTI14_IRQ                        40
#define EXTI15_IRQ                        40
/*==========================================================*/
/*USART_IRQ MACROS*/
/*==========================================================*/
#define USART1_IRQ                        37
#define USART2_IRQ                        38
#define USART3_IRQ                        39
/*==========================================================*/
/*SPI_IRQ MACROS*/
/*==========================================================*/
#define SPI1_IRQ	                      35
#define SPI2_IRQ                          36
/*==========================================================*/
/*I2C_IRQ MACROS*/
/*==========================================================*/
#define I2C1_EV_IRQ                       31
#define I2C1_ER_IRQ                       32
#define I2C2_EV_IRQ                       33
#define I2C2_ER_IRQ                       34
/*==========================================================*/
/*NVIC IRQ ENABLE/DISABLE MACROS*/
/*==========================================================*/
//ENABLE
//EXTI
#define NVIC_IRQ6_EXTI0_ENABLE()             (NVIC_ISER0 |=(1<<6))
#define NVIC_IRQ7_EXTI1_ENABLE()             (NVIC_ISER0 |=(1<<7))
#define NVIC_IRQ8_EXTI2_ENABLE()             (NVIC_ISER0 |=(1<<8))
#define NVIC_IRQ9_EXTI3_ENABLE()             (NVIC_ISER0 |=(1<<9))
#define NVIC_IRQ10_EXTI4_ENABLE()            (NVIC_ISER0 |=(1<<10))
#define NVIC_IRQ23_EXTI5_9_ENABLE()          (NVIC_ISER0 |=(1<<23))
#define NVIC_IRQ40_EXTI0_15_ENABLE()         (NVIC_ISER1 |=(1<<8)) //40-32=8



//DISABLE
//EXTI
#define NVIC_IRQ6_EXTI0_DISABLE()             (NVIC_ICER0 |=(1<<6))
#define NVIC_IRQ7_EXTI1_DISABLE()             (NVIC_ICER0 |=(1<<7))
#define NVIC_IRQ8_EXTI2_DISABLE()             (NVIC_ICER0 |=(1<<8))
#define NVIC_IRQ9_EXTI3_DISABLE()             (NVIC_ICER0 |=(1<<9))
#define NVIC_IRQ10_EXTI4_DISABLE()            (NVIC_ICER0 |=(1<<10))
#define NVIC_IRQ23_EXTI5_9_DISABLE()          (NVIC_ICER0 |=(1<<23))
#define NVIC_IRQ40_EXTI0_15_DISABLE()         (NVIC_ICER1 |=(1<<8)) //40-32=8
//UART

//ENABLE
//USART
#define NVIC_IRQ37_USART1_ENABLE()           (NVIC_ISER1 |=(1<<5)) //37-32=5
#define NVIC_IRQ38_USART2_ENABLE()           (NVIC_ISER1 |=(1<<6)) //38-32=6
#define NVIC_IRQ39_USART3_ENABLE()           (NVIC_ISER1 |=(1<<7)) //39-32=7

//DISABLE
//USART
#define NVIC_IRQ37_USART1_DISABLE()          (NVIC_ICER1 |=(1<<5)) //37-32=5
#define NVIC_IRQ38_USART2_DISABLE()          (NVIC_ICER1 |=(1<<6)) //38-32=6
#define NVIC_IRQ39_USART3_DISABLE()          (NVIC_ICER1 |=(1<<7)) //39-32=7

//ENABLE_SPI
#define NVIC_IRQ35_SPI1_ENABLE()             (NVIC_ISER1 |=(1<<3)) //35-32=3
#define NVIC_IRQ36_SPI2_ENABLE()             (NVIC_ISER1 |=(1<<4)) //36-32=4

//DISABLE_SPI
#define NVIC_IRQ35_SPI1_DISABLE()            (NVIC_ICER1 |=(1<<3)) //35-32=3
#define NVIC_IRQ36_SPI2_DISABLE()            (NVIC_ICER1 |=(1<<4)) //36-32=4


